---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewVertexIndexPair(System.Int32,System.Int32)
source: html/0797652a-f7ff-ad75-24ec-4481d87b1fa2.htm
---
# Autodesk.Revit.Creation.Application.NewVertexIndexPair Method

Creates a new VertexIndexPair object.

## Syntax (C#)
```csharp
public VertexIndexPair NewVertexIndexPair(
	int iTop,
	int iBottom
)
```

## Parameters
- **iTop** (`System.Int32`) - The index of the vertex pair from the top profile of a blend.
- **iBottom** (`System.Int32`) - The index of the vertex pair from the bottom profile of a blend.

## Returns
The new VertexIndexPair object.